var lang_ru = {
  headerText: "Обновление Wi-Fi® устройства",
  systemInfo: "Система:",
  firmwareInfo: "Версия устройства:",
  pageTitle_default: "Обновление устройства",
  helpTitle_default:
    'Чтобы обновить устройство, нажмите "Выбрать файл" ниже, а затем выберите файл обновления Wi-Fi. Затем нажмите "Выгрузить".',
  uploadBoxMessage_default: "Добавление файла обновления",
  chooseFile: "Выбрать файл",
  upload: "Выгрузить",
  pageTitle_uploading: "Отличная работа!",
  helpTitle_uploading:
    "Файл передается в систему Wi-Fi. Для этого может потребоваться до 10 минут в зависимости от того, насколько далеко находится динамик от маршрутизатора.",
  uploadBoxMessage_uploading: "Выгрузка...",
  pageTitle_finished: "Выгрузка завершена!",
  helpTitle_finished:
    "Сейчас начнется обновление устройства. После завершения обновления, устройство перезапустится и будет готово к воспроизведению. Это займет всего несколько минут.",
  pageTitle_error: "Ой...",
  helpTitle_error: "Произошел сбой. Попробуйте обновить страницу.",
  btn_error: "Повторить попытку",
  upload_error_unable_to_create_unzip: "Не удалось создать распакованный файл из-за возникшей ошибки.",
  upload_error_not_enough_space:
    "Недостаточно свободного места для распаковки файла обновления.",
  upload_error_problem_unzipping: "Не удалось распаковать файл обновления из-за возникшей ошибки. Попробуйте снова загрузить файл.",
  upload_error_invalid_zip: "Не сработало. Попробуйте снова загрузить файл.",
  upload_error_timeout:
    "Произошел сбой. Проверьте текущее состояние по панели индикаторов.",
  upload_error_missing_sig_file: "Не сработало. Попробуйте снова загрузить файл.",
  upload_error_validation_issue: "Не сработало. Попробуйте снова загрузить файл.",
  upload_error_invalid_metadata: "Не сработало. Загрузите более новый файл и повторите попытку.",
  upload_error_product_mismatch: "Данный файл предназначен для другого устройства. Загрузите файл для устройства и повторите попытку.",
  upload_error_signing_key_mismatch: "Не сработало. Загрузите другой файл и повторите попытку.",
  upload_error_unsupported_version:
    "Не сработало. Загрузите другой файл и повторите попытку."
};