var lang_el = {
  headerText: "Ενημέρωση Wi-Fi® προϊόντος",
  systemInfo: "Το σύστημά σας:",
  firmwareInfo: "Έκδοση προϊόντος:",
  pageTitle_default: "Ενημέρωση του προϊόντος σας",
  helpTitle_default:
    'Για να ενημερώσετε το προϊόν σας, κάντε κλικ στο «Επιλογή αρχείου» παρακάτω και επιλέξτε το αρχείο ενημέρωσης Wi-Fi. Κατόπιν, κάντε κλικ στο «Αποστολή».',
  uploadBoxMessage_default: "Προσθήκη αρχείου ενημέρωσης",
  chooseFile: "Επιλογή αρχείου",
  upload: "Αποστολή",
  pageTitle_uploading: "Πολύ ωραία!",
  helpTitle_uploading:
    "Το αρχείο μεταφέρεται στο σύστημα Wi-Fi σας. Αυτό μπορεί να διαρκέσει έως και 10 λεπτά, ανάλογα με το πόσο μακριά είναι το ηχείο σας από τον δρομολογητή σας.",
  uploadBoxMessage_uploading: "Γίνεται αποστολή...",
  pageTitle_finished: "Η αποστολή ολοκληρώθηκε!",
  helpTitle_finished:
    "Το προϊόν σας θα ξεκινήσει την ενημέρωση. Μόλις ολοκληρωθεί η ενημέρωση, θα γίνει επανεκκίνηση και θα είναι έτοιμο για αναπαραγωγή. Η διαδικασία αυτή θα διαρκέσει μόνο λίγα λεπτά.",
  pageTitle_error: "Ωχ...",
  helpTitle_error: "Κάτι πήγε στραβά. Δοκιμάστε να ανανεώσετε τη σελίδα.",
  btn_error: "Δοκιμάστε ξανά",
  upload_error_unable_to_create_unzip: "Συνέβη κάτι και δεν μπορέσαμε να δημιουργήσουμε το ασυμπίεστο αρχείο.",
  upload_error_not_enough_space:
    "Δεν υπάρχει αρκετός χώρος διαθέσιμος για αποσυμπίεση του αρχείου ενημέρωσης.",
  upload_error_problem_unzipping: "Συνέβη κάτι και δεν μπορέσαμε να αποσυμπιέσουμε το αρχείο ενημέρωσης. Δοκιμάστε να επαναλάβετε τη λήψη του αρχείου.",
  upload_error_invalid_zip: "Αυτό δεν λειτούργησε. Δοκιμάστε να επαναλάβετε τη λήψη του αρχείου.",
  upload_error_timeout:
    "Κάτι πήγε στραβά. Ελέγξτε τη φωτεινή γραμμή για την τρέχουσα κατάσταση.",
  upload_error_missing_sig_file: "Αυτό δεν λειτούργησε. Δοκιμάστε να επαναλάβετε τη λήψη του αρχείου.",
  upload_error_validation_issue: "Αυτό δεν λειτούργησε. Δοκιμάστε να επαναλάβετε τη λήψη του αρχείου.",
  upload_error_invalid_metadata: "Αυτό δεν λειτούργησε. Κατεβάστε ένα νεότερο αρχείο και δοκιμάστε ξανά.",
  upload_error_product_mismatch: "Το αρχείο αυτό προορίζεται για διαφορετικό προϊόν. Κατεβάστε το αρχείο για το προϊόν σας και δοκιμάστε ξανά.",
  upload_error_signing_key_mismatch: "Αυτό δεν λειτούργησε. Κατεβάστε ένα διαφορετικό αρχείο και δοκιμάστε ξανά.",
  upload_error_unsupported_version:
    "Αυτό δεν λειτούργησε. Κατεβάστε ένα διαφορετικό αρχείο και δοκιμάστε ξανά."
};